{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "creepy_flirt",
    "1": "harassment_med",
    "2": "harassment_mild",
    "3": "harassment_severe",
    "4": "safe",
    "5": "stalker_behavior"
  },
  "initializer_range": 0.02,
  "label2id": {
    "creepy_flirt": 0,
    "harassment_med": 1,
    "harassment_mild": 2,
    "harassment_severe": 3,
    "safe": 4,
    "stalker_behavior": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
